app/views/bookings/edit.html.erb

<label> Conference Room </label><br/>
<%= f.collection_select :conference_room_id, ConferenceRoom.all, :id, :name %><br/>
---
SELECT "conference_rooms".* FROM "conference_rooms"