app/views/bookings/index.html.erb

					<td> <%= booking.user_id %> </td>
					<td> <%= ConferenceRoom.find(booking.conference_room_id).name%> </td>
---
SELECT  "conference_rooms".* FROM "conference_rooms" WHERE "conference_rooms"."id" = ? LIMIT 1  [["id", 2]]

		<% data = {}
		rooms = ConferenceRoom.all
		rooms.each do |room|
			data[room.name] = Booking.where('conference_room_id =?',room.id).count
---
SELECT "conference_rooms".* FROM "conference_rooms"
SELECT COUNT(*) FROM "bookings" WHERE (conference_room_id =1)