app/views/bookings/new.html.erb

SELECT "conference_rooms".* FROM "conference_rooms"
---
		<label> Conference Room </label><br/>
		<%= f.collection_select :conference_room_id, ConferenceRoom.all, :id, :name, {prompt:"select client"} ,{class: "form-control"}%><br/>