app/views/bookings/show.html.erb

SELECT  "conference_rooms".* FROM "conference_rooms" WHERE "conference_rooms"."id" = ? LIMIT 1  [["id", 2]]
---
<h4> User Id : <%= @booking.user_id %> </h4>
<h4> Conference Room : <%= ConferenceRoom.find(@booking.conference_room_id).name%> </h4>