app/views/conference_rooms/edit.html.erb

SELECT "buildings".* FROM "buildings"
---
<label> Building_id </label><br/>
<%= f.collection_select :building_id,Building.all,:id,:name %> <br/>