app/views/conference_rooms/new.html.erb

	<label> Block</label> <br/>
	<%= f.collection_select :building_id, Building.all, :id, :name , {class:"form-control"}%> <br/>
---
SELECT "buildings".* FROM "buildings"

		<label> Select Facilities </label> <br/>
		<%= f.collection_check_boxes :facility_ids,Facility.all,:id,:name,{class:"form-control"} do |b| %>
---
SELECT "facilities".* FROM "facilities"