app/views/conference_rooms/show.html.erb


<h4> Building : <%= Building.find(@conference_room.building_id ).name%> </h4>
---
SELECT  "buildings".* FROM "buildings" WHERE "buildings"."id" = ? LIMIT 1  [["id", 3]]


<% facility = @conference_room.facilities.pluck(:name) %>
---
SELECT "facilities"."name" FROM "facilities" INNER JOIN "conference_room_facilities" ON "facilities"."id" = "conference_room_facilities"."facility_id" WHERE "conference_room_facilities"."conference_room_id" = ?  [["conference_room_id", 12]]


	<% if @conference_room.bookings.empty? %>
---
SELECT  1 AS one FROM "bookings" WHERE "bookings"."conference_room_id" = ? LIMIT 1  [["conference_room_id", 1]]
SELECT "bookings".* FROM "bookings" WHERE "bookings"."conference_room_id" = ?  [["conference_room_id", 1]]