app/controllers/bookings_controller.rb

	def create
		@booking = Booking.new(booking_params)
		@booking.user_id = current_user.id
		if @booking.save
---
INSERT INTO "bookings" ("user_id", "conference_room_id", "start_date_time", "end_date_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

	def show

			@booking = current_user.bookings.find(params[:id])
---
SELECT  "bookings".* FROM "bookings" WHERE "bookings"."user_id" = ? AND "bookings"."id" = ? LIMIT 1  [["user_id", 2], ["id", 35]]

	def edit
		#@booking = Booking.find(params[:id])
		@booking = current_user.bookings.find(params[:id])
---
SELECT  "bookings".* FROM "bookings" WHERE "bookings"."user_id" = ? AND "bookings"."id" = ? LIMIT 1  [["user_id", 1], ["id", 16]]

	def update
		#@booking = Booking.find(params[:id])
		@booking = current_user.bookings.find(params[:id])
		@booking.user_id = current_user.id
		if @booking.update_attributes(booking_params)
---
SELECT  "bookings".* FROM "bookings" WHERE "bookings"."user_id" = ? AND "bookings"."id" = ? LIMIT 1  [["user_id", 1], ["id", 16]]
UPDATE "bookings" SET "start_date_time" = ?, "end_date_time" = ?, "updated_at" = ? WHERE "bookings"."id" = ?  [["start_date_time", "2000-01-01 00:00:00.000000"], ["end_date_time", "2000-01-01 00:00:00.000000"], ["updated_at", "2016-07-28 19:54:14.722302"], ["id", 1]]

	def destroy
		#@booking = Booking.find(params[:id])
		@booking = current_user.bookings.find(params[:id])
		@booking.destroy
---
SELECT  "bookings".* FROM "bookings" WHERE "bookings"."user_id" = ? AND "bookings"."id" = ? LIMIT 1  [["user_id", 2], ["id", 14]]
DELETE FROM "bookings" WHERE "bookings"."id" = ?  [["id", 9]]