app/controllers/buildings_controller.rb

	def create
		@building = Building.new(building_params)
		if @building.save
---
INSERT INTO "buildings" ("name", "code", "landmark", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Block D"], ["code", "D001"], ["landmark", "Near Fitness Center"], ["created_at", "2016-08-04 17:46:42.353385"], ["updated_at", "2016-08-04 17:46:42.353385"]]

	def show
		@building = Building.find(params[:id])
---
SELECT  "buildings".* FROM "buildings" WHERE "buildings"."id" = ? LIMIT 1  [["id", 0]]

	def edit
		@building = Building.find(params[:id])
---
SELECT  "buildings".* FROM "buildings" WHERE "buildings"."id" = ? LIMIT 1  [["id", 4]]

	def update
		@building = Building.find(params[:id])
		if @building.update_attributes(building_params)
---
SELECT  "buildings".* FROM "buildings" WHERE "buildings"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "buildings" SET "code" = ?, "updated_at" = ? WHERE "buildings"."id" = ?  [["code", "D000"], ["updated_at", "2016-08-04 18:12:20.459712"], ["id", 4]]

	def destroy
		@building = Building.find(params[:id])
		@building.destroy
---
SELECT  "buildings".* FROM "buildings" WHERE "buildings"."id" = ? LIMIT 1  [["id", 4]]
DELETE FROM "buildings" WHERE "buildings"."id" = ?  [["id", 4]]