app/controllers/conference_rooms_controller.rb

	def index
	@conference_rooms = ConferenceRoom.all
---
SELECT "conference_rooms".* FROM "conference_rooms"

	def create
			@conference_room = ConferenceRoom.new(conference_room_params)
			if @conference_room.save
---
INSERT INTO "conference_rooms" ("name", "building_id", "floor", "landmark", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Agastya"], ["building_id", 2], ["floor", "1"], ["landmark", "near "], ["created_at", "2016-07-26 07:58:10.227891"], ["updated_at", "2016-07-26 07:58:10.227891"]]

	def show
		@conference_room = ConferenceRoom.find(params[:id])
---
SELECT  "conference_rooms".* FROM "conference_rooms" WHERE "conference_rooms"."id" = ? LIMIT 1  [["id", 6]]

	def edit
		@conference_room = ConferenceRoom.find(params[:id])
---
SELECT  "conference_rooms".* FROM "conference_rooms" WHERE "conference_rooms"."id" = ? LIMIT 1  [["id", 1]]

	def update
		@conference_room = ConferenceRoom.find(params[:id])
		if @conference_room.update_attributes(conference_room_params)
---
SELECT  "conference_rooms".* FROM "conference_rooms" WHERE "conference_rooms"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "conference_rooms" SET "building_id" = ?, "updated_at" = ? WHERE "conference_rooms"."id" = ?  [["building_id", 1], ["updated_at", "2016-07-28 17:44:44.153875"], ["id", 8]]

	def destroy
		@conference_room = ConferenceRoom.find(params[:id])
		@conference_room.destroy
---
SELECT  "conference_rooms".* FROM "conference_rooms" WHERE "conference_rooms"."id" = ? LIMIT 1  [["id", 7]]
DELETE FROM "conference_rooms" WHERE "conference_rooms"."id" = ?  [["id", 7]]