app/controllers/facilities_controller.rb

SELECT "facilities".* FROM "facilities"
---
	def index
		@facilities = Facility.all

INSERT INTO "facilities" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Audio"], ["created_at", "2016-07-31 16:38:42.920442"], ["updated_at", "2016-07-31 16:38:42.920442"]]
---
	def create
		@facility = Facility.new(facility_params)
		if @facility.save

SELECT  "facilities".* FROM "facilities" WHERE "facilities"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		@facility = Facility.find(params[:id])

SELECT  "facilities".* FROM "facilities" WHERE "facilities"."id" = ? LIMIT 1  [["id", 1]]
---
	def edit
		@facility = Facility.find(params[:id])

SELECT  "facilities".* FROM "facilities" WHERE "facilities"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "facilities" SET "name" = ?, "updated_at" = ? WHERE "facilities"."id" = ?  [["name", " Video conferencee"], ["updated_at", "2016-07-31 17:20:43.253694"], ["id", 1]]
---
	def update
		@facility = Facility.find(params[:id])
		if @facility.update_attributes(facility_params)

SELECT  "facilities".* FROM "facilities" WHERE "facilities"."id" = ? LIMIT 1  [["id", 7]]
DELETE FROM "facilities" WHERE "facilities"."id" = ?  [["id", 7]]
---
	def destroy
		@facility = Facility.find(params[:id])
		@facility.destroy